from Classes import Todolist
import os
import random
dec = Todolist("./List")


#       ,-=-.       ______     _
#      /  +  \     />----->  _| |_
#      | ~~~ |    // -/- /  |_   _|
#      |R.I.P|   //  /  /     | |
# \vV,,|_____|V,//_____/VvV,v,|_|/,,vhjwv/,#
#
#
#
#
#
#
#
#
#




























    #for i in open_file(filename):
    #print(words_arr)
#print("|ДОБРО ПОЖАЛОВАТЬ В АНКИ ДЛЯ БЕДНЫХ|\n|КРАТКАЯ НАВИГАЦИЯ ПО КОМАНДАМ|\n|(1)запись - запись значений (1)   |\n|(2)запоминание - режим запоминания(2)|\n|(3)вывод - вывод словаря в формате Слово-значение-контекст(3)  |\n|выход - выход из програмы     |")
continuing = True
os.system('cls' if os.name == 'nt' else 'clear')

while continuing:
    #os.system('cls' if os.name == 'nt' else 'clear')
    #print("|ДОБРО ПОЖАЛОВАТЬ В АНКИ ДЛЯ БЕДНЫХ|\n|КРАТКАЯ НАВИГАЦИЯ ПО КОМАНДАМ|\n|(1)запись - запись значений (1)   |\n|(2)запоминание - режим запоминания(2)|\n|(3)вывод - вывод словаря в формате Слово-значение-контекст(3)  |\n| (4) очистка файла      |\n|(5) перезапись слова |\n   \n|выход - выход из програмы     |")
    print("╔══════════════════════════════════════╗")
    print("║           СПИСОК ДЕЛ С ХАРАКТЕРОМ          ║")
    print("║         твоя продуктивность имеет значение ║")
    print("╠══════════════════════════════════════╣")
    print("║ [1] ➕ Добавить задачу                ║")
    print("║ [2] ✅ Отметить выполнение            ║  ")
    print("║ [3] 🗑️  Удалить задачу                ║")
    print("║ [4] 📋 Показать все задачи           ║")
    print("║                                      ║")
    print("║ [выход] Закрыть программу            ║")
    print("╠══════════════════════════════════════╣")
    print("║ Текущее самоуважение: [###____] 3/10 ║")
    print("╚══════════════════════════════════════╝")


    user_input = input("Ведите режим: ")
    if user_input =="1":
        n = input("Введите количество слов которе вы введете: ")
        try:
            n = int(n)
            for _ in range(n):
                word = input("Слово:")
                meaning = input("Значение:")
                time = input("Время в формате %H.%M.%d.%m,%Y")
                dec.create(word,meaning,time)
        except:
            print("Неправильный ввод начинайте по новой")
    
    
    
    elif user_input.lower() =="выход":
        continuing = False 
    elif user_input == "2":
        print(dec.NST_arr)
        if dec.NST_arr !=[]:
            user_input = input("номер изменения")
            user_status = input("СТАТУС: ")
            dec.update_task(user_input,user_status)
        else:
            print("=ОШИБКА ФАЙЛ ПУСТОЙ=")
    elif user_input == "3":
        #print(dec.words_array)
        if dec.NST_arr !=[]:
            user_input = input("номер удаления")
            dec.delete(user_input)
        else:
            print("=ОШИБКА ФАЙЛ ПУСТОЙ=")
    elif user_input =="4":
        for el in dec.NST_arr:
            print(el)
        inp = input("Введите что то если прочитали")
        os.system('cls' if os.name == 'nt' else 'clear')
    
        pass
        # print("|=== ДОБРО ПОЖАЛОВАТЬ В АНКИ ДЛЯ БЕДНЫХ      ===|")
        # print("|======== КРАТКАЯ НАВИГАЦИЯ ПО КОМАНДАМ ========|")
        # print("| (1) запись - запись значений                  |")
        # print("| (2) запоминание - режим запоминания           |")  
        # print("| (3) вывод - вывод словаря                     |")
        # print("| (4) очистка файла                             |")
        # print("| (5) перезапись слова                          |")
        # print("| (6) удаление термина                          |")
        # print("|===============================================|")
        # print("| выход - выход из программы                    |")
        # print("| help - помощь                                 |")
        # print("|===============================================|")
    else:
        print("Пересмотрите свои отношения к вводу комманд")
    print(dec.respect)
    

